Revit 2026 API

# ParameterDownloadOptions Methods

---

The ParameterDownloadOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCategories | Get categories for binding. |
|  | GetGroupTypeId | Get properties palette group identifier. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetCategories |  |
|  | SetGroupTypeId | Set properties palette group identifier. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ParameterDownloadOptions Class

Autodesk.Revit.DB Namespace